STM8-SPL-license/discussion/Header/STM8AF_STM8S_mask.h
///< irq23 - TIM4, TIM6 Update/Overflow interrupt
#if defined(TIM4_BaseAddress)
  #define __TIM4_UPD_OVF_VECTOR__ 23    ///< irq23 - TIM4 Update/Overflow interrupt
#elif defined(TIM6_BaseAddress)
  #define __TIM6_UPD_OVF_VECTOR__ 23    ///< irq23 - TIM6 Update/Overflow interrupt
#endif

/// irq24 - flash interrupt
#define __FLASH_VECTOR__          24


/*-----------------------------------------------------------------------------
    DEFINITION OF STM8 PERIPHERAL REGISTERS
-----------------------------------------------------------------------------*/

//------------------------
// PORT ports (implemented on all devices)
//------------------------
#if defined(PORTA_BaseAddress) || defined(PORTB_BaseAddress) || defined(PORTC_BaseAddress) || defined(PORTD_BaseAddress) || \
    defined(PORTE_BaseAddress) || defined(PORTF_BaseAddress) || defined(PORTG_BaseAddress) || defined(PORTH_BaseAddress) || \
    defined(PORTI_BaseAddress)

  /** structure for controlling/monitoring pins in PORT mode (PORT_t) */
  typedef struct {
    uint8_t   ODR;                ///< Port x output data register (Px_ODR)
    uint8_t   IDR;                ///< Port x pin input register (Px_IDR)
    uint8_t   DDR;                ///< Port x data direction register (Px_DDR)
    uint8_t   CR1;                ///< Port x control register 1 (Px_CR1)
    uint8_t   CR2;                ///< Port x control register 2 (Px_CR2)
  } PORT_t;

  // port A..F implemented on all devices
  #if defined(PORTA_BaseAddress)
    #define _GPIOA      SFR(PORT_t, PORTA_BaseAddress)  ///< registers for port A access
  #endif
  #if defined(PORTB_BaseAddress)
    #define _GPIOB      SFR(PORT_t, PORTB_BaseAddress)  ///< registers for port B access
  #endif
  #if defined(PORTC_BaseAddress)
    #define _GPIOC      SFR(PORT_t, PORTC_BaseAddress)  ///< registers for port C access
  #endif
  #if defined(PORTD_BaseAddress)
    #define _GPIOD      SFR(PORT_t, PORTD_BaseAddress)  ///< registers for port D access
  #endif
  #if defined(PORTE_BaseAddress)
    #define _GPIOE      SFR(PORT_t, PORTE_BaseAddress)  ///< registers for port E access
  #endif
  #if defined(PORTF_BaseAddress)
    #define _GPIOF      SFR(PORT_t, PORTF_BaseAddress)  ///< registers for port F access
  #endif
  #if defined(PORTG_BaseAddress)
    #define _GPIOG      SFR(PORT_t, PORTG_BaseAddress)  ///< registers for port G access
  #endif
  #if defined(PORTH_BaseAddress)
    #define _GPIOH      SFR(PORT_t, PORTH_BaseAddress)  ///< registers for port H access
  #endif
  #if defined(PORTI_BaseAddress)
    #define _GPIOI      SFR(PORT_t, PORTI_BaseAddress)  ///< registers for port I access
  #endif

  /* PORT Module Reset Values (all ports) */
  #define PORT_ODR_RESET_VALUE ((uint8_t)0x00)
  #define PORT_DDR_RESET_VALUE ((uint8_t)0x00)
  #define PORT_CR1_RESET_VALUE ((uint8_t)0x00)
  #define PORT_CR2_RESET_VALUE ((uint8_t)0x00)

  /* macro for accessing pins (all ports) */
  #define PIN0   ((uint8_t) (0x01 << 0))
  #define PIN1   ((uint8_t) (0x01 << 1))
  #define PIN2   ((uint8_t) (0x01 << 2))
  #define PIN3   ((uint8_t) (0x01 << 3))
  #define PIN4   ((uint8_t) (0x01 << 4))
  #define PIN5   ((uint8_t) (0x01 << 5))
  #define PIN6   ((uint8_t) (0x01 << 6))
  #define PIN7   ((uint8_t) (0x01 << 7))

#endif // PORTx_BaseAddress



//------------------------
// Clock module CLK (implemented on all devices)
//------------------------
#if defined(CLK_BaseAddress)

  /** struct containing clock module registers (CLK) */
  typedef struct {

    uint8_t   ICKR;               ///< Internal clock register
    uint8_t   ECKR;               ///< External clock register
    uint8_t   res;                ///< Reserved register (1B)
    uint8_t   CMSR;               ///< Clock master status register
    uint8_t   SWR;                ///< Clock master switch register
    uint8_t   SWCR;               ///< Switch control register
    uint8_t   CKDIVR;             ///< Clock divider register
    uint8_t   PCKENR1;            ///< Peripheral clock gating register 1
    uint8_t   CSSR;               ///< Clock security system register
    uint8_t   CCOR;               ///< Configurable clock output register
    uint8_t   PCKENR2;            ///< Peripheral clock gating register 2
    uint8_t   res1;               ///< Reserved register (1B)
    uint8_t   HSITRIMR;           ///< HSI clock calibration trimming register
    uint8_t   SWIMCCR;            ///< SWIM clock control register

  } CLK_t;

  /// pointer to CLK registers
  #define _CLK        SFR(CLK_t, CLK_BaseAddress)
  
  /* CLK Module Reset Values */
  #define _CLK_ICKR_RESET_VALUE     ((uint8_t) 0x01)
  #define _CLK_ECKR_RESET_VALUE     ((uint8_t) 0x00)
  #define _CLK_CMSR_RESET_VALUE     ((uint8_t) 0xE1)
  #define _CLK_SWR_RESET_VALUE      ((uint8_t) 0xE1)
  #define _CLK_SWCR_RESET_VALUE     ((uint8_t) 0x00)
  #define _CLK_CKDIVR_RESET_VALUE   ((uint8_t) 0x18)
  #define _CLK_PCKENR1_RESET_VALUE  ((uint8_t) 0xFF)
  #define _CLK_PCKENR2_RESET_VALUE  ((uint8_t) 0xFF)
  #define _CLK_CSSR_RESET_VALUE     ((uint8_t) 0x00)
  #define _CLK_CCOR_RESET_VALUE     ((uint8_t) 0x00)
  #define _CLK_HSITRIMR_RESET_VALUE ((uint8_t) 0x00)
  #define _CLK_SWIMCCR_RESET_VALUE  ((uint8_t) 0x00)

  /* Internal clock register (CLK_ICKR) bits */
  #define _CLK_HSIEN              ((uint8_t) (0x01 << 0))        ///< High speed internal RC oscillator enable [0]
  #define _CLK_HSIRDY             ((uint8_t) (0x01 << 1))        ///< High speed internal oscillator ready [0]
  #define _CLK_FHWU               ((uint8_t) (0x01 << 2))        ///< Fast wakeup from Halt/Active-halt modes [0]
  #define _CLK_LSIEN              ((uint8_t) (0x01 << 3))        ///< Low speed internal RC oscillator enable [0]
  #define _CLK_LSIRDY             ((uint8_t) (0x01 << 4))        ///< Low speed internal oscillator ready [0]
  #define _CLK_REGAH              ((uint8_t) (0x01 << 5))        ///< Regulator power off in Active-halt mode [0]
  // reserved [7:6]

  /* External clock register (CLK_ECKR) */
  #define _CLK_HSEEN              ((uint8_t) (0x01 << 0))        ///< High speed external crystal oscillator enable [0]
  #define _CLK_ECKR_HSERDY        ((uint8_t) (0x01 << 1))        ///< High speed external crystal oscillator ready [0]
  // reserved [7:2]

