STM8-SPL-license/discussion/Header/STM8AF_STM8S_mask.h
  /* UART2 Module Reset Values */
  #define _UART2_SR_RESET_VALUE   ((uint8_t) 0xC0)
  #define _UART2_BRR1_RESET_VALUE ((uint8_t) 0x00)
  #define _UART2_BRR2_RESET_VALUE ((uint8_t) 0x00)
  #define _UART2_CR1_RESET_VALUE  ((uint8_t) 0x00)
  #define _UART2_CR2_RESET_VALUE  ((uint8_t) 0x00)
  #define _UART2_CR3_RESET_VALUE  ((uint8_t) 0x00)
  #define _UART2_CR4_RESET_VALUE  ((uint8_t) 0x00)
  #define _UART2_CR5_RESET_VALUE  ((uint8_t) 0x00)
  #define _UART2_CR6_RESET_VALUE  ((uint8_t) 0x00)
  #define _UART2_GTR_RESET_VALUE  ((uint8_t) 0x00)
  #define _UART2_PSCR_RESET_VALUE ((uint8_t) 0x00)

  /* UART2 Status register (UART2_SR) bits */
  #define _UART2_PE               ((uint8_t) (0x01 << 0))        ///< Parity error [0]
  #define _UART2_FE               ((uint8_t) (0x01 << 1))        ///< Framing error [0]
  #define _UART2_NF               ((uint8_t) (0x01 << 2))        ///< Noise flag [0]
  #define _UART2_OR_LHE           ((uint8_t) (0x01 << 3))        ///< LIN Header Error (LIN slave mode) / Overrun error [0]
  #define _UART2_IDLE             ((uint8_t) (0x01 << 4))        ///< IDLE line detected [0]
  #define _UART2_RXNE             ((uint8_t) (0x01 << 5))        ///< Read data register not empty [0]
  #define _UART2_TC               ((uint8_t) (0x01 << 6))        ///< Transmission complete [0]
  #define _UART2_TXE              ((uint8_t) (0x01 << 7))        ///< Transmit data register empty [0]

  /* UART2 Control register 1 (UART2_CR1) bits */
  #define _UART2_PIEN             ((uint8_t) (0x01 << 0))        ///< Parity interrupt enable [0]
  #define _UART2_PS               ((uint8_t) (0x01 << 1))        ///< Parity selection [0]
  #define _UART2_PCEN             ((uint8_t) (0x01 << 2))        ///< Parity control enable [0]
  #define _UART2_WAKE             ((uint8_t) (0x01 << 3))        ///< Wakeup method [0]
  #define _UART2_M                ((uint8_t) (0x01 << 4))        ///< word length [0]
  #define _UART2_UARTD            ((uint8_t) (0x01 << 5))        ///< UART Disable (for low power consumption) [0]
  #define _UART2_T8               ((uint8_t) (0x01 << 6))        ///< Transmit Data bit 8 (in 9-bit mode) [0]
  #define _UART2_R8               ((uint8_t) (0x01 << 7))        ///< Receive Data bit 8 (in 9-bit mode) [0]

  /* UART2 Control register 2 (UART2_CR2) bits */
  #define _UART2_SBK              ((uint8_t) (0x01 << 0))        ///< Send break [0]
  #define _UART2_RWU              ((uint8_t) (0x01 << 1))        ///< Receiver wakeup [0]
  #define _UART2_REN              ((uint8_t) (0x01 << 2))        ///< Receiver enable [0]
  #define _UART2_TEN              ((uint8_t) (0x01 << 3))        ///< Transmitter enable [0]
  #define _UART2_ILIEN            ((uint8_t) (0x01 << 4))        ///< IDLE Line interrupt enable [0]
  #define _UART2_RIEN             ((uint8_t) (0x01 << 5))        ///< Receiver interrupt enable [0]
  #define _UART2_TCIEN            ((uint8_t) (0x01 << 6))        ///< Transmission complete interrupt enable [0]
  #define _UART2_TIEN             ((uint8_t) (0x01 << 7))        ///< Transmitter interrupt enable [0]


  /* UART2 Control register 3 (UART2_CR3) bits */
  #define _UART2_LBCL             ((uint8_t) (0x01 << 0))        ///< Last bit clock pulse [0]
  #define _UART2_CPHA             ((uint8_t) (0x01 << 1))        ///< Clock phase [0]
  #define _UART2_CPOL             ((uint8_t) (0x01 << 2))        ///< Clock polarity [0]
  #define _UART2_CKEN             ((uint8_t) (0x01 << 3))        ///< Clock enable [0]
  #define _UART2_STOP             ((uint8_t) 0x30)               ///< STOP bits [1:0]
  #define _UART2_STOP0            ((uint8_t) (0x01 << 4))        ///< STOP bits [0]
  #define _UART2_STOP1            ((uint8_t) (0x01 << 5))        ///< STOP bits [1]
  #define _UART2_LINEN            ((uint8_t) (0x01 << 6))        ///< LIN mode enable [0]
  // reserved [7]

  /* UART2 Control register 4 (UART2_CR4) bits */
  #define _UART2_ADD              ((uint8_t) 0x0F)               ///< Address of the UART node [3:0]
  #define _UART2_ADD0             ((uint8_t) (0x01 << 0))        ///< Address of the UART node [0]
  #define _UART2_ADD1             ((uint8_t) (0x01 << 1))        ///< Address of the UART node [1]
  #define _UART2_ADD2             ((uint8_t) (0x01 << 2))        ///< Address of the UART node [2]
  #define _UART2_ADD3             ((uint8_t) (0x01 << 3))        ///< Address of the UART node [3]
  #define _UART2_LBDF             ((uint8_t) (0x01 << 4))        ///< LIN Break Detection Flag [0]
  #define _UART2_LBDL             ((uint8_t) (0x01 << 5))        ///< LIN Break Detection Length [0]
  #define _UART2_LBDIEN           ((uint8_t) (0x01 << 6))        ///< LIN Break Detection Interrupt Enable [0]
  // reserved [7]

  /* UART2 Control register 5 (UART2_CR5) bits */
  // reserved [0]
  #define _UART2_IREN             ((uint8_t) (0x01 << 1))        ///< IrDA mode Enable [0]
  #define _UART2_IRLP             ((uint8_t) (0x01 << 2))        ///< IrDA Low Power [0]
  // reserved [3]
  #define _UART2_NACK             ((uint8_t) (0x01 << 4))        ///< Smartcard NACK enable [0]
  #define _UART2_SCEN             ((uint8_t) (0x01 << 5))        ///< Smartcard mode enable [0]
  // reserved [7:6]
 
  /* UART2 Control register 6 (UART2_CR6) bits */
  #define _UART2_LSF              ((uint8_t) (0x01 << 0))        ///< LIN Sync Field [0]
  #define _UART2_LHDF             ((uint8_t) (0x01 << 1))        ///< LIN Header Detection Flag [0]
  #define _UART2_LHDIEN           ((uint8_t) (0x01 << 2))        ///< LIN Header Detection Interrupt Enable [0]
  // reserved [3]
  #define _UART2_LASE             ((uint8_t) (0x01 << 4))        ///< LIN automatic resynchronisation enable [0]
  #define _UART2_LSLV             ((uint8_t) (0x01 << 5))        ///< LIN Slave Enable [0]
  // reserved [6]
  #define _UART2_LDUM             ((uint8_t) (0x01 << 7))        ///< LIN Divider Update Method [0]

#endif // UART2_BaseAddress



//------------------------
// 8-Bit Timer TIM4 (selected devices)
//------------------------
#if defined(TIM4_BaseAddress)

  /** struct containing UART2 registers (selected devices) */
  typedef struct   {

    uint8_t   CR1;                ///< Control register
    #if defined(STM8S103) || defined(STM8S003)
      uint8_t res[2];             // reserved (2B)
    #endif
    uint8_t   IER;                ///< Interrupt enable register
    uint8_t   SR;                 ///< Status register
    uint8_t   EGR;                ///< Event generation register
    uint8_t   CNTR;               ///< Counter register
    uint8_t   PSCR;               ///< Prescaler register
    uint8_t   ARR;                ///< Auto-reload register

  } TIM4_t;

