STM8-SPL-license/discussion/Header/STM8AF_STM8S_mask.h
  /// pointer to TIM4 registers
  #define _TIM4       SFR(TIM4_t, TIM4_BaseAddress)  

  /* TIM4 Module Reset Values */
  #define _TIM4_CR1_RESET_VALUE  ((uint8_t)0x00)
  #define _TIM4_IER_RESET_VALUE  ((uint8_t)0x00)
  #define _TIM4_SR1_RESET_VALUE  ((uint8_t)0x00)
  #define _TIM4_EGR_RESET_VALUE  ((uint8_t)0x00)
  #define _TIM4_CNTR_RESET_VALUE ((uint8_t)0x00)
  #define _TIM4_PSCR_RESET_VALUE ((uint8_t)0x00)
  #define _TIM4_ARR_RESET_VALUE  ((uint8_t)0xFF)

  /* TIM4 Control register (TIM4_CR1) */
  #define _TIM4_CEN               ((uint8_t) (0x01 << 0))        ///< Counter enable [0]
  #define _TIM4_UDIS              ((uint8_t) (0x01 << 1))        ///< Counter enable [0]
  #define _TIM4_URS               ((uint8_t) (0x01 << 2))        ///< Counter enable [0]
  #define _TIM4_OPM               ((uint8_t) (0x01 << 3))        ///< Counter enable [0]
  // reserved [6:4]
  #define _TIM4_ARPE              ((uint8_t) (0x01 << 7))        ///< Counter enable [0]

  /*  TIM4 Interrupt enable (TIM4_IER) */
  #define _TIM4_UIE               ((uint8_t) (0x01 << 0))        ///< Update interrupt enable [0]
  // reserved [7:1]

  /*  TIM4 Status register (TIMx_SR) */
  #define _TIM4_UIF               ((uint8_t) (0x01 << 0))        ///< Trigger interrupt flag [0]
  // reserved [7:1]

  /*  TIM4 Event generation register (TIMx_EGR) */
  #define _TIM4_UG                ((uint8_t) (0x01 << 0))        ///< Update generation [0]
  // reserved [7:1]

  /* TIM4 Prescaler register (TIM4_PSCR) */
  #define _TIM4_PSC               ((uint8_t) 0x07)               ///< Prescaler value [2:0]
  #define _TIM4_PSC0              ((uint8_t) (0x01 << 0))        ///< Prescaler value [0]
  #define _TIM4_PSC1              ((uint8_t) (0x01 << 1))        ///< Prescaler value [1]
  #define _TIM4_PSC2              ((uint8_t) (0x01 << 2))        ///< Prescaler value [2]
  // reserved [7:3]

#endif // TIM4_BaseAddress


/*-----------------------------------------------------------------------------
    END OF MODULE DEFINITION FOR MULTIPLE INLUSION
-----------------------------------------------------------------------------*/
#endif // _STM8AF_STM8S_H_
